#####################โหลดไลบรารี่ที่จำเป็น######################

import streamlit as st #สำหรับสร้างเว็บ
import pandas as pd #สำหรับจัดการข้อมูล
import numpy as np #สำหรับคำนวณตัวเลข
import plotly.graph_objects as go #สำหรับสร้างกราฟ
from statsmodels.tsa.statespace.sarimax import SARIMAX  #สำหรับทำโมเดลพยากรณ์
from sklearn.metrics import mean_squared_error  #ประเมินความแม่นยำของโมเดล


#################### Step 1 สร้างการ ตั้งค่าหน้าเว็บ

st.set_page_config(layout="wide")   #ตั้งค่าให้เว็บเต็มหน้าจอ
st.title("พยากรณ์ปริมาณฝนรายเดือน")  #หัวข้อหลักของเว็บ


###################### step 2 สร้างส่วนอัปโหลดไฟล์

file = st.file_uploader("📂 อัปโหลดไฟล์ Excel", type=["xlsx"])  

if file is not None:  #ถ้ามีการอัปโหลดไฟล์เข้ามา

   #################### step 3 อ่านข้อมูลและเตรียมข้อมูล
   
    df = pd.read_excel(file) #คอ่านข้อมูลจากไฟล์ Excel ที่อัปโหลดเข้ามา
    df.columns = df.columns.str.strip()    #ลบช่องว่างที่อาจจะมีในชื่อคอลัมน์

    required_cols = ["วันที่", "ชื่อเขต", "ปริมาณฝนรายวัน"]   #กำหนดชื่อคอลัมน์ที่ต้องมีในข้อมูล
    for col in required_cols: #ตรวจสอบว่าคอลัมน์ที่จำเป็นมีอยู่ในข้อมูลหรือไม่
        if col not in df.columns:   #ถ้าไม่มีคอลัมน์ที่จำเป็น ให้แสดงข้อความผิดพลาดและหยุดการทำงานของโปรแกรม
            st.error(f"ไม่พบคอลัมน์: {col}")    #แสดงข้อความผิดพลาดถ้าไม่มีคอลัมน์ที่จำเป็น
            st.stop()   #หยุดการทำงานของโปรแกรมถ้าไม่มีคอลัมน์ที่จำเป็น

    df["วันที่"] = pd.to_datetime(df["วันที่"])   #แปลงคอลัมน์ "วันที่" เป็นชนิดวันที่
    df = df.sort_values("วันที่")   #เรียงข้อมูลตามวันที่จากน้อยไปมาก

    
    ########################## step 4 ทำ Sidebar ข้างๆ สำหรับตั้งค่าการพยากรณ์
    
    st.sidebar.header("ตั้งค่าการพยากรณ์")  #หัวข้อใน Sidebar

    forecast_months = st.sidebar.slider(      #ตัวเลื่อนสำหรับเลือกจำนวนเดือนที่จะพยากรณ์ล่วงหน้า
        "พยากรณ์ล่วงหน้า (เดือน)",
        1, 12, 12    #ค่าเริ่มต้นคือ 12 เดือน และสามารถเลือกได้ตั้งแต่ 1 ถึง 12 เดือน
    )

    view_type = st.sidebar.radio(    #ตัวเลือกสำหรับเลือกมุมมองข้อมูล
        "มุมมอง",
        ["ภาพรวมโรงงาน", "รายเขต"]   #ถ้าเลือก "ภาพรวมโรงงาน" จะแสดงข้อมูลรวมทั้งหมด ถ้าเลือก "รายเขต" จะให้เลือกเขตที่ต้องการดูข้อมูล
    )

    if view_type == "รายเขต":     #ถ้าเลือกมุมมองเป็น "รายเขต" ให้แสดงตัวเลือกสำหรับเลือกเขต
        region = st.sidebar.selectbox(      #ตัวเลือกสำหรับเลือกเขตที่ต้องการดูข้อมูล
            "เลือกเขต",  #ตัวเลือกจะถูกสร้างจากค่าที่ไม่ซ้ำกันในคอลัมน์ "ชื่อเขต" ของข้อมูล
            df["ชื่อเขต"].unique()   #สร้างตัวเลือกจากค่าที่ไม่ซ้ำกันในคอลัมน์ "ชื่อเขต" ของข้อมูล
        )
        df = df[df["ชื่อเขต"] == region]   #กรองข้อมูลให้เหลือเฉพาะเขตที่เลือก

    
    ############################## step 5 สร้างข้อมูลรายเดือน เพราะโมเดลที่ดีที่สุดคือ SARIMA(1,0,1)(1,1,0,12) ตามที่ได้ทดลองมาแล้วในขั้นตอนก่อนหน้านี้ เราจะใช้โมเดลนี้ในการทำนายค่าปริมาณฝนรายเดือน โดยกำหนดพารามิเตอร์ของโมเดลตามที่ได้ทดลองมาแล้ว และใช้ข้อมูลชุดฝึกสอน (Train) ในการสร้างโมเดลเพื่อให้ได้ผลการทำนายที่แม่นยำที่สุดสำหรับการพยากรณ์ล่วงหน้า
    
    if view_type == "ภาพรวมโรงงาน":  #ถ้าเลือกมุมมองเป็น "ภาพรวมโรงงาน" ให้คำนวณข้อมูลรายเดือนโดยเฉลี่ยจากทุกเขต

        monthly_per_region = (  #คำนวณปริมาณฝนรายเดือนโดยรวมทุกเขต โดยการรวมข้อมูลตามชื่อเขตและเดือน จากนั้นคำนวณค่าเฉลี่ยของปริมาณฝนรายวันในแต่ละเดือน
            df.groupby(["ชื่อเขต", pd.Grouper(key="วันที่", freq="M")])["ปริมาณฝนรายวัน"]   #กลุ่มข้อมูลตามชื่อเขตและเดือน จากนั้นคำนวณผลรวมของปริมาณฝนรายวันในแต่ละกลุ่ม
            .sum()  #คำนวณผลรวมของปริมาณฝนรายวันในแต่ละกลุ่ม
            .reset_index()  #รีเซ็ตดัชนีหลังจากการกลุ่มข้อมูล
        )

        df_monthly = (   #คำนวณปริมาณฝนรายเดือนโดยเฉลี่ยจากทุกเขต โดยการรวมข้อมูลตามวันที่ จากนั้นคำนวณค่าเฉลี่ยของปริมาณฝนรายวันในแต่ละเดือน
            monthly_per_region #คำนวณปริมาณฝนรายเดือนโดยเฉลี่ยจากทุกเขต โดยการรวมข้อมูลตามวันที่ จากนั้นคำนวณค่าเฉลี่ยของปริมาณฝนรายวันในแต่ละเดือน
            .groupby("วันที่")["ปริมาณฝนรายวัน"]  #กลุ่มข้อมูลตามวันที่ จากนั้นคำนวณค่าเฉลี่ยของปริมาณฝนรายวันในแต่ละเดือน
            .mean()  #คำนวณค่าเฉลี่ยของปริมาณฝนรายวันในแต่ละเดือน
            .reset_index()  #รีเซ็ตดัชนีหลังจากการกลุ่มข้อมูล
        )

    else:   #ถ้าเลือกมุมมองเป็น "รายเขต" ให้คำนวณข้อมูลรายเดือนโดยรวมเฉพาะเขตที่เลือก โดยการรวมข้อมูลตามวันที่ จากนั้นคำนวณผลรวมของปริมาณฝนรายวันในแต่ละเดือน
        df_monthly = (     #คำนวณปริมาณฝนรายเดือนโดยรวมเฉพาะเขตที่เลือก โดยการรวมข้อมูลตามวันที่ จากนั้นคำนวณผลรวมของปริมาณฝนรายวันในแต่ละเดือน
            df.resample("M", on="วันที่")["ปริมาณฝนรายวัน"]   #คำนวณปริมาณฝนรายเดือนโดยรวมเฉพาะเขตที่เลือก โดยการรวมข้อมูลตามวันที่ จากนั้นคำนวณผลรวมของปริมาณฝนรายวันในแต่ละเดือน
            .sum()  #คำนวณผลรวมของปริมาณฝนรายวันในแต่ละเดือน
            .reset_index() #รีเซ็ตดัชนีหลังจากการคำนวณปริมาณฝนรายเดือนโดยรวมเฉพาะเขตที่เลือก โดยการรวมข้อมูลตามวันที่ จากนั้นคำนวณผลรวมของปริมาณฝนรายวันในแต่ละเดือน
        )  

    df_monthly = df_monthly.dropna()   #ลบแถวที่มีค่า NaN ออกจากข้อมูลรายเดือน

    st.subheader("📈 ข้อมูลรายเดือนย้อนหลัง")   
    st.dataframe(df_monthly.tail(), use_container_width=True)  #แสดงข้อมูลรายเดือนย้อนหลัง 5 แถวสุดท้ายในรูปแบบตาราง และปรับขนาดให้เต็มความกว้างของคอนเทนเนอร์

    
    ########################### step 6 Train/Test เพราะโมเดลที่ดีที่สุดคือ SARIMA(1,0,1)(1,1,0,12) ตามที่ได้ทดลองมาแล้วในขั้นตอนก่อนหน้านี้ เราจะใช้โมเดลนี้ในการทำนายค่าปริมาณฝนรายเดือน โดยกำหนดพารามิเตอร์ของโมเดลตามที่ได้ทดลองมาแล้ว และใช้ข้อมูลชุดฝึกสอน (Train) ในการสร้างโมเดลเพื่อให้ได้ผลการทำนายที่แม่นยำที่สุดสำหรับการพยากรณ์ล่วงหน้า
    
    train_size = int(len(df_monthly) * 0.8)  #กำหนดขนาดของชุดข้อมูลฝึกสอน (Train) เป็น 80% ของข้อมูลทั้งหมด และชุดข้อมูลทดสอบ (Test) เป็น 20% ของข้อมูลทั้งหมด

    if train_size < 12:  #ถ้าขนาดของชุดข้อมูลฝึกสอนน้อยกว่า 12 แถว (ประมาณ 1 ปี) ให้แสดงข้อความเตือนและหยุดการทำงานของโปรแกรม
        st.warning("ข้อมูลย้อนหลังน้อยเกินไป (ควรมีอย่างน้อย 2 ปี)")    #แสดงข้อความเตือนถ้าข้อมูลย้อนหลังน้อยเกินไป (ควรมีอย่างน้อย 2 ปี)
        st.stop()  #หยุดการทำงานของโปรแกรมถ้าข้อมูลย้อนหลังน้อยเกินไป (ควรมีอย่างน้อย 2 ปี)

    train = df_monthly["ปริมาณฝนรายวัน"][:train_size]   #กำหนดชุดข้อมูลฝึกสอน (Train) เป็นคอลัมน์ "ปริมาณฝนรายวัน" ตั้งแต่แถวแรกจนถึงแถวที่กำหนดโดย train_size
    test = df_monthly["ปริมาณฝนรายวัน"][train_size:]     #กำหนดชุดข้อมูลทดสอบ (Test) เป็นคอลัมน์ "ปริมาณฝนรายวัน" ตั้งแต่แถวที่กำหนดโดย train_size จนถึงแถวสุดท้าย

  
    ############ step 7 SARIMA  เพราะโมเดลที่ดีที่สุดคือ SARIMA(1,0,1)(1,1,0,12) ตามที่ได้ทดลองมาแล้วในขั้นตอนก่อนหน้านี้ เราจะใช้โมเดลนี้ในการทำนายค่าปริมาณฝนรายเดือน โดยกำหนดพารามิเตอร์ของโมเดลตามที่ได้ทดลองมาแล้ว และใช้ข้อมูลชุดฝึกสอน (Train) ในการสร้างโมเดลเพื่อให้ได้ผลการทำนายที่แม่นยำที่สุดสำหรับการพยากรณ์ล่วงหน้า
   
    model = SARIMAX(         #สร้างโมเดล SARIMA โดยใช้ชุดข้อมูลฝึกสอน (Train) และกำหนดพารามิเตอร์ของโมเดลตามที่กำหนดไว้ในคำสั่ง SARIMAX
        train,                    #ใช้ชุดข้อมูลฝึกสอน (Train) เป็นข้อมูลที่ใช้ในการสร้างโมเดล SARIMA
        order=(1,0,1),                 #กำหนดพารามิเตอร์ของโมเดล SARIMA โดยใช้ค่า (p,d,q) = (1,0,1) ซึ่งหมายถึง AR(1), I(0), MA(1)
        seasonal_order=(1,1,0,12),        #กำหนดพารามิเตอร์ของโมเดล SARIMA สำหรับส่วนฤดูกาล โดยใช้ค่า (P,D,Q,s) = (1,1,0,12) ซึ่งหมายถึง SAR(1), SI(1), SMA(0) และความถี่ของฤดูกาลเป็น 12 เดือน
        enforce_stationarity=True,            #กำหนดให้โมเดล SARIMA บังคับให้ข้อมูลมีความคงที่ (Stationarity) โดยใช้พารามิเตอร์ enforce_stationarity=True
        enforce_invertibility=True                #กำหนดให้โมเดล SARIMA บังคับให้โมเดลมีความสามารถในการกลับตัว (Invertibility) โดยใช้พารามิเตอร์ enforce_invertibility=True
    )

    result = model.fit(disp=False)        #ฝึกสอนโมเดล SARIMA โดยใช้ข้อมูลจากชุดข้อมูลฝึกสอน (Train) และไม่แสดงข้อความการฝึกสอนในคอนโซลโดยใช้พารามิเตอร์ disp=False
    pred_test = result.forecast(len(test))  #ใช้โมเดลที่ฝึกสอนแล้วในการทำนายค่าของชุดข้อมูลทดสอบ (Test) โดยใช้คำสั่ง forecast และกำหนดจำนวนค่าที่ต้องการทำนายเป็นความยาวของชุดข้อมูลทดสอบ (len(test))
    rmse = np.sqrt(mean_squared_error(test, pred_test))   #คำนวณค่า Root Mean Squared Error (RMSE) เพื่อประเมินความแม่นยำของโมเดล SARIMA โดยใช้คำสั่ง mean_squared_error เพื่อคำนวณค่า Mean Squared Error (MSE) ระหว่างค่าจริงในชุดข้อมูลทดสอบ (Test) และค่าที่ทำนายโดยโมเดล (pred_test) จากนั้นใช้ np.sqrt เพื่อคำนวณค่า RMSE จากค่า MSE

   
    ####################### step 8  Final Forecast เพราะโมเดลที่ดีที่สุดคือ SARIMA(1,0,1)(1,1,0,12) ตามที่ได้ทดลองมาแล้วในขั้นตอนก่อนหน้านี้ เราจะใช้โมเดลนี้ในการทำนายค่าปริมาณฝนรายเดือนล่วงหน้า โดยกำหนดพารามิเตอร์ของโมเดลตามที่ได้ทดลองมาแล้ว และใช้ข้อมูลทั้งหมดในการฝึกสอนโมเดลเพื่อให้ได้ผลการทำนายที่แม่นยำที่สุดสำหรับการพยากรณ์ล่วงหน้า
    
    final_model = SARIMAX(                #สร้างโมเดล SARIMA โดยใช้ข้อมูลทั้งหมดในการฝึกสอนโมเดล และกำหนดพารามิเตอร์ของโมเดลตามที่กำหนดไว้ในคำสั่ง SARIMAX
        df_monthly["ปริมาณฝนรายวัน"],           #ใช้ข้อมูลทั้งหมดในคอลัมน์ "ปริมาณฝนรายวัน" เป็นข้อมูลที่ใช้ในการฝึกสอนโมเดล SARIMA
        order=(1,0,1),                            #กำหนดพารามิเตอร์ของโมเดล SARIMA โดยใช้ค่า (p,d,q) = (1,0,1) ซึ่งหมายถึง AR(1), I(0), MA(1)
        seasonal_order=(1,1,0,12),                     #กำหนดพารามิเตอร์ของโมเดล SARIMA สำหรับส่วนฤดูกาล โดยใช้ค่า (P,D,Q,s) = (1,1,0,12) ซึ่งหมายถึง SAR(1), SI(1), SMA(0) และความถี่ของฤดูกาลเป็น 12 เดือน  
        enforce_stationarity=True,                        #กำหนดให้โมเดล SARIMA บังคับให้ข้อมูลมีความคงที่ (Stationarity) โดยใช้พารามิเตอร์ enforce_stationarity=True
        enforce_invertibility=True                           #กำหนดให้โมเดล SARIMA บังคับให้โมเดลมีความสามารถในการกลับตัว (Invertibility) โดยใช้พารามิเตอร์ enforce_invertibility=True
    )

    final_result = final_model.fit(disp=False)                  #ฝึกสอนโมเดล SARIMA โดยใช้ข้อมูลทั้งหมดในคอลัมน์ "ปริมาณฝนรายวัน" และไม่แสดงข้อความการฝึกสอนในคอนโซลโดยใช้พารามิเตอร์ disp=False
    forecast = final_result.forecast(forecast_months)                #ใช้โมเดลที่ฝึกสอนแล้วในการทำนายค่าปริมาณฝนรายเดือนล่วงหน้าตามจำนวนเดือนที่เลือกในตัวเลื่อน (forecast_months) โดยใช้คำสั่ง forecast และกำหนดจำนวนค่าที่ต้องการทำนายเป็นค่าที่เลือกในตัวเลื่อน (forecast_months)

    # กันค่าติดลบ เพราะปริมาณฝนไม่สามารถเป็นค่าติดลบได้ ดังนั้นเราจะใช้ np.maximum เพื่อกำหนดให้ค่าที่ทำนายออกมาไม่ต่ำกว่า 0
    forecast = np.maximum(forecast, 0) #กำหนดให้ค่าที่ทำนายออกมาไม่ต่ำกว่า 0 โดยใช้ np.maximum เพื่อเปรียบเทียบค่าที่ทำนายออกมากับ 0 และเลือกค่าที่มากกว่าหรือเท่ากับ 0 เป็นค่าที่จะใช้ในการพยากรณ์ล่วงหน้า

    # smoothing ลดความแกว่ง เพราะบางครั้งโมเดลอาจจะทำนายค่าที่มีความแกว่งสูงเกินไป ดังนั้นเราจะใช้การคำนวณค่าเฉลี่ยเคลื่อนที่ (Rolling Mean) เพื่อช่วยลดความแกว่งของค่าที่ทำนายออกมา โดยกำหนดให้ใช้ค่าเฉลี่ยของ 2 เดือนล่าสุดในการคำนวณค่าที่ทำนายออกมา
    forecast = pd.Series(forecast).rolling(2, min_periods=1).mean()  #ใช้การคำนวณค่าเฉลี่ยเคลื่อนที่ (Rolling Mean) เพื่อช่วยลดความแกว่งของค่าที่ทำนายออกมา โดยกำหนดให้ใช้ค่าเฉลี่ยของ 2 เดือนล่าสุดในการคำนวณค่าที่ทำนายออกมา โดยใช้คำสั่ง rolling(2, min_periods=1).mean() ซึ่งหมายถึงการคำนวณค่าเฉลี่ยของ 2 เดือนล่าสุด และกำหนด min_periods=1 เพื่อให้สามารถคำนวณค่าเฉลี่ยได้แม้ในกรณีที่มีเพียงเดือนเดียวในช่วงเวลานั้น

    # จำกัดไม่ให้เกิน 120% ของค่าสูงสุดในอดีต เพราะบางครั้งโมเดลอาจจะทำนายค่าที่สูงเกินไป ซึ่งอาจจะไม่สมเหตุสมผล ดังนั้นเราจะใช้ np.minimum เพื่อกำหนดให้ค่าที่ทำนายออกมาไม่เกิน 120% ของค่าสูงสุดที่เคยเกิดขึ้นในอดีต โดยการคำนวณค่าสูงสุดจากข้อมูลรายเดือนในอดีต และนำมาคูณด้วย 1.2 เพื่อกำหนดขอบเขตสูงสุดของค่าที่ทำนายออกมา
    historical_max = df_monthly["ปริมาณฝนรายวัน"].max()          #คำนวณค่าสูงสุดจากข้อมูลรายเดือนในอดีต โดยใช้คำสั่ง max() เพื่อหาค่าสูงสุดในคอลัมน์ "ปริมาณฝนรายวัน" ของข้อมูลรายเดือน
    forecast = np.minimum(forecast, historical_max * 1.2)            #กำหนดให้ค่าที่ทำนายออกมาไม่เกิน 120% ของค่าสูงสุดที่เคยเกิดขึ้นในอดีต โดยใช้ np.minimum เพื่อเปรียบเทียบค่าที่ทำนายออกมากับ historical_max * 1.2 และเลือกค่าที่น้อยกว่าหรือเท่ากับ historical_max * 1.2 เป็นค่าที่จะใช้ในการพยากรณ์ล่วงหน้า

    future_dates = pd.date_range(                   #สร้างช่วงของวันที่สำหรับการพยากรณ์ล่วงหน้า โดยใช้คำสั่ง pd.date_range และกำหนดให้เริ่มต้นจากวันที่สุดท้ายในข้อมูลรายเดือน (df_monthly["วันที่"].max()) และมีจำนวนช่วงเวลาตามที่เลือกในตัวเลื่อน (forecast_months) โดยใช้ความถี่เป็น "M" ซึ่งหมายถึงรายเดือน
        start=df_monthly["วันที่"].max(),                  #กำหนดให้เริ่มต้นจากวันที่สุดท้ายในข้อมูลรายเดือน (df_monthly["วันที่"].max())
        periods=forecast_months+1,                             #กำหนดจำนวนช่วงเวลาตามที่เลือกในตัวเลื่อน (forecast_months) โดยเพิ่ม 1 เพื่อให้รวมเดือนสุดท้ายของข้อมูลรายเดือนด้วย
        freq="M"                                                      #กำหนดความถี่เป็น "M" ซึ่งหมายถึงรายเดือน
    )[1:]        #เลือกช่วงของวันที่สำหรับการพยากรณ์ล่วงหน้า โดยใช้ [1:] เพื่อเลือกเฉพาะวันที่หลังจากเดือนสุดท้ายของข้อมูลรายเดือน (df_monthly["วันที่"].max()) ซึ่งเป็นช่วงของวันที่ที่เราต้องการพยากรณ์ล่วงหน้า

    
    #################### step 9 เดือนภาษาไทย
    
    thai_months = {
        1: "มกราคม",
        2: "กุมภาพันธ์",
        3: "มีนาคม",
        4: "เมษายน",
        5: "พฤษภาคม",
        6: "มิถุนายน",
        7: "กรกฎาคม",
        8: "สิงหาคม",
        9: "กันยายน",
        10: "ตุลาคม",
        11: "พฤศจิกายน",
        12: "ธันวาคม"
    }

    thai_labels = [thai_months[m] for m in future_dates.month]    #สร้างป้ายชื่อเดือนภาษาไทยสำหรับการพยากรณ์ล่วงหน้า โดยใช้การทำความเข้าใจค่าของเดือนจาก future_dates.month และแปลงเป็นชื่อเดือนภาษาไทยโดยใช้พจนานุกรม thai_months ซึ่งมีการจับคู่ระหว่างหมายเลขเดือนและชื่อเดือนภาษาไทย จากนั้นใช้ list comprehension เพื่อสร้างรายการของป้ายชื่อเดือนภาษาไทยสำหรับแต่ละเดือนในช่วงของวันที่ที่เราต้องการพยากรณ์ล่วงหน้า

    forecast_df = pd.DataFrame({                                      #สร้าง DataFrame สำหรับการแสดงผลการพยากรณ์ล่วงหน้า โดยใช้ pd.DataFrame และกำหนดคอลัมน์ "เดือน" ให้มีค่าจาก thai_labels ซึ่งเป็นป้ายชื่อเดือนภาษาไทยที่เราสร้างขึ้น และคอลัมน์ "พยากรณ์ฝน (มม.)" ให้มีค่าจาก forecast.values ซึ่งเป็นค่าที่ทำนายออกมาจากโมเดล SARIMA สำหรับแต่ละเดือนในช่วงของวันที่ที่เราต้องการพยากรณ์ล่วงหน้า
        "เดือน": thai_labels,                                                #กำหนดคอลัมน์ "เดือน" ให้มีค่าจาก thai_labels ซึ่งเป็นป้ายชื่อเดือนภาษาไทยที่เราสร้างขึ้น
        "พยากรณ์ฝน (มม.)": forecast.values                                       #กำหนดคอลัมน์ "พยากรณ์ฝน (มม.)" ให้มีค่าจาก forecast.values ซึ่งเป็นค่าที่ทำนายออกมาจากโมเดล SARIMA สำหรับแต่ละเดือนในช่วงของวันที่ที่เราต้องการพยากรณ์ล่วงหน้า
    })

    
    ##################### step 10 แปลผล (รายเดือน)
    
    def interpret_rain(mm):       #ฟังก์ชันสำหรับแปลผลปริมาณฝนที่ทำนายออกมาเป็นข้อความที่เข้าใจง่าย โดยใช้เกณฑ์ที่กำหนดไว้ในคำสั่ง if-elif เพื่อแปลผลปริมาณฝนที่ทำนายออกมาเป็นข้อความที่อธิบายระดับของปริมาณฝน เช่น "ไม่ตก", "ฝนเล็กน้อย", "ฝนปานกลาง", "ฝนหนัก", หรือ "ฝนหนักมาก" ตามค่าของ mm ซึ่งเป็นค่าปริมาณฝนที่ทำนายออกมา
        if mm <= 0:                  #ถ้าปริมาณฝนที่ทำนายออกมา (mm) น้อยกว่าหรือเท่ากับ 0 ให้แปลผลเป็น "ไม่ตก"
            return "ไม่ตก"
        elif mm <= 50:                #ถ้าปริมาณฝนที่ทำนายออกมา (mm) น้อยกว่าหรือเท่ากับ 50 ให้แปลผลเป็น "ฝนเล็กน้อย"
            return "ฝนเล็กน้อย"
        elif mm <= 200:
            return "ฝนปานกลาง"
        elif mm <= 400:
            return "ฝนหนัก"
        else:
            return "ฝนหนักมาก"

    forecast_df["แปลผล"] = forecast_df["พยากรณ์ฝน (มม.)"].apply(interpret_rain)     #ใช้ฟังก์ชัน interpret_rain เพื่อแปลผลปริมาณฝนที่ทำนายออกมาในคอลัมน์ "พยากรณ์ฝน (มม.)" และสร้างคอลัมน์ใหม่ชื่อ "แปลผล" ใน DataFrame forecast_df เพื่อเก็บข้อความที่แปลผลออกมา โดยใช้คำสั่ง apply เพื่อใช้ฟังก์ชัน interpret_rain กับแต่ละค่าปริมาณฝนที่ทำนายออกมาในคอลัมน์ "พยากรณ์ฝน (มม.)"

    
    ########################## step 11 คำนวณ ค่า Confidence เพราะบางครั้งโมเดลอาจจะทำนายค่าที่ไม่แม่นยำ ดังนั้นเราจะใช้ค่า RMSE ที่คำนวณได้จากการประเมินความแม่นยำของโมเดลในชุดข้อมูลทดสอบ (Test) มาเปรียบเทียบกับค่าเฉลี่ยของปริมาณฝนรายวันในอดีต เพื่อคำนวณค่า Confidence หรือความเชื่อมั่นในการพยากรณ์ล่วงหน้า โดยใช้สูตร Confidence = max(0, 100 * (1 - (RMSE / Mean Rain))) ซึ่งจะให้ค่า Confidence เป็นเปอร์เซ็นต์ที่แสดงถึงความเชื่อมั่นในการพยากรณ์ล่วงหน้า โดยถ้า RMSE มีค่าสูงเกินไปเมื่อเทียบกับค่าเฉลี่ยของปริมาณฝนรายวันในอดีต ค่า Confidence จะลดลง และถ้า RMSE มีค่าต่ำเมื่อเทียบกับค่าเฉลี่ยของปริมาณฝนรายวันในอดีต ค่า Confidence จะสูงขึ้น
    
    mean_rain = df_monthly["ปริมาณฝนรายวัน"].mean()           #คำนวณค่าเฉลี่ยของปริมาณฝนรายวันในอดีต โดยใช้คำสั่ง mean() เพื่อหาค่าเฉลี่ยในคอลัมน์ "ปริมาณฝนรายวัน" ของข้อมูลรายเดือน
    confidence = max(0, 100 * (1 - (rmse / mean_rain)))            #คำนวณค่า Confidence หรือความเชื่อมั่นในการพยากรณ์ล่วงหน้า โดยใช้สูตร Confidence = max(0, 100 * (1 - (RMSE / Mean Rain))) ซึ่งจะให้ค่า Confidence เป็นเปอร์เซ็นต์ที่แสดงถึงความเชื่อมั่นในการพยากรณ์ล่วงหน้า โดยถ้า RMSE มีค่าสูงเกินไปเมื่อเทียบกับค่าเฉลี่ยของปริมาณฝนรายวันในอดีต ค่า Confidence จะลดลง และถ้า RMSE มีค่าต่ำเมื่อเทียบกับค่าเฉลี่ยของปริมาณฝนรายวันในอดีต ค่า Confidence จะสูงขึ้น
    forecast_df["ความเชื่อมั่น (%)"] = round(confidence, 2)                #เพิ่มคอลัมน์ "ความเชื่อมั่น (%)" ใน DataFrame forecast_df เพื่อเก็บค่า Confidence หรือความเชื่อมั่นในการพยากรณ์ล่วงหน้า โดยใช้คำสั่ง round เพื่อปัดเศษค่า Confidence ให้มีทศนิยม 2 ตำแหน่ง
    
    forecast_df = forecast_df[                                           #จัดเรียงคอลัมน์ใน DataFrame forecast_df ให้มีลำดับตามที่กำหนดไว้ในคำสั่ง forecast_df = forecast_df[["เดือน", "พยากรณ์ฝน (มม.)", "แปลผล", "ความเชื่อมั่น (%)"]]                                          
        ["เดือน", "พยากรณ์ฝน (มม.)", "แปลผล", "ความเชื่อมั่น (%)"]                 #กำหนดลำดับของคอลัมน์ใน DataFrame forecast_df ให้เป็น "เดือน", "พยากรณ์ฝน (มม.)", "แปลผล", และ "ความเชื่อมั่น (%)" ตามลำดับที่กำหนดไว้ในคำสั่ง forecast_df = forecast_df[["เดือน", "พยากรณ์ฝน (มม.)", "แปลผล", "ความเชื่อมั่น (%)"]
    ]

   
    ######################## step 12 แสดงผล
    
    st.subheader("📅 ผลพยากรณ์ล่วงหน้า")    
    st.dataframe(
        forecast_df.style.format({"พยากรณ์ฝน (มม.)": "{:.2f}"}),  #แสดงผลการพยากรณ์ล่วงหน้าในรูปแบบตาราง โดยใช้ st.dataframe และปรับรูปแบบการแสดงผลของคอลัมน์ "พยากรณ์ฝน (มม.)" ให้มีทศนิยม 2 ตำแหน่งโดยใช้คำสั่ง style.format({"พยากรณ์ฝน (มม.)": "{:.2f}"}) และปรับขนาดให้เต็มความกว้างของคอนเทนเนอร์โดยใช้
        use_container_width=True                                       #ปรับขนาดให้เต็มความกว้างของคอนเทนเนอร์โดยใช้ use_container_width=True ในคำสั่ง st.dataframe เพื่อให้ตารางแสดงผลได้เต็มความกว้างของพื้นที่ที่มีอยู่ในเว็บ
    )

   
    ################## step 13 กราฟเฉพาะ Forecast
    
    fig = go.Figure()         #สร้างกราฟเปล่าโดยใช้ go.Figure() จากไลบรารี Plotly เพื่อเตรียมสำหรับการเพิ่มข้อมูลการพยากรณ์ล่วงหน้าในรูปแบบของเส้นกราฟ

    fig.add_trace(go.Scatter(              #เพิ่มข้อมูลการพยากรณ์ล่วงหน้าในรูปแบบของเส้นกราฟโดยใช้คำสั่ง add_trace และกำหนดให้ใช้ go.Scatter เพื่อสร้างกราฟเส้น โดยกำหนดค่า x เป็นป้ายชื่อเดือนภาษาไทย (thai_labels) และค่า y เป็นค่าที่ทำนายออกมาจากโมเดล SARIMA สำหรับแต่ละเดือนในช่วงของวันที่ที่เราต้องการพยากรณ์ล่วงหน้า (forecast) และกำหนดโหมดเป็น "lines+markers" เพื่อแสดงทั้งเส้นกราฟและจุดข้อมูล และกำหนดชื่อของเส้นกราฟเป็น "Forecast" และปรับความหนาของเส้นกราฟให้เป็น 3 โดยใช้ line=dict(width=3)
        x=thai_labels,                            #กำหนดค่า x เป็นป้ายชื่อเดือนภาษาไทย (thai_labels) ที่เราสร้างขึ้นสำหรับการพยากรณ์ล่วงหน้า
        y=forecast,                                    #กำหนดค่า y เป็นค่าที่ทำนายออกมาจากโมเดล SARIMA สำหรับแต่ละเดือนในช่วงของวันที่ที่เราต้องการพยากรณ์ล่วงหน้า (forecast)
        mode="lines+markers",                               #กำหนดโหมดเป็น "lines+markers" เพื่อแสดงทั้งเส้นกราฟและจุดข้อมูลในกราฟ
        name="Forecast",                                          #กำหนดชื่อของเส้นกราฟเป็น "Forecast" เพื่อให้สามารถแยกแยะได้ในกราฟ
        line=dict(width=3)                                               #ปรับความหนาของเส้นกราฟให้เป็น 3 โดยใช้ line=dict(width=3
    ))

    fig.update_layout(                        #ปรับแต่งรูปแบบของกราฟโดยใช้คำสั่ง update_layout เพื่อกำหนดหัวข้อของกราฟเป็น "พยากรณ์ปริมาณฝนรายเดือน" และกำหนดชื่อแกน x เป็น "เดือน" และชื่อแกน y เป็น "ปริมาณฝน (มม.)" และใช้เทมเพลต "plotly_white" เพื่อให้กราฟมีพื้นหลังสีขาวและรูปแบบที่เรียบง่าย
        title="พยากรณ์ปริมาณฝนรายเดือน",              #กำหนดหัวข้อของกราฟเป็น "พยากรณ์ปริมาณฝนรายเดือน" เพื่อให้ผู้ใช้เข้าใจได้ง่ายว่าเป็นกราฟที่แสดงผลการพยากรณ์ปริมาณฝนรายเดือน
        xaxis_title="เดือน",                              #กำหนดชื่อแกน x เป็น "เดือน" เพื่อให้ผู้ใช้เข้าใจได้ง่ายว่าแกน x แสดงข้อมูลเกี่ยวกับเดือนที่ทำนายออกมา
        yaxis_title="ปริมาณฝน (มม.)",                         #กำหนดชื่อแกน y เป็น "ปริมาณฝน (มม.)" เพื่อให้ผู้ใช้เข้าใจได้ง่ายว่าแกน y แสดงข้อมูลเกี่ยวกับปริมาณฝนที่ทำนายออกมาในหน่วยมิลลิเมตร
        template="plotly_white"                                      #ใช้เทมเพลต "plotly_white" เพื่อให้กราฟมีพื้นหลังสีขาวและรูปแบบที่เรียบง่าย ซึ่งช่วยให้ข้อมูลในกราฟโดดเด่นและง่ายต่อการอ่าน
    )

    st.plotly_chart(fig, use_container_width=True)     #แสดงกราฟการพยากรณ์ล่วงหน้าในเว็บโดยใช้ st.plotly_chart และปรับขนาดให้เต็มความกว้างของคอนเทนเนอร์โดยใช้ use_container_width=True เพื่อให้กราฟแสดงผลได้เต็มความกว้างของพื้นที่ที่มีอยู่ในเว็บ

else:           #ถ้าไม่มีการอัปโหลดไฟล์เข้ามา ให้แสดงข้อความแจ้งเตือนให้ผู้ใช้ทราบว่าต้องอัปโหลดไฟล์ก่อนที่จะสามารถดูผลการพยากรณ์ได้ โดยใช้ st.info เพื่อแสดงข้อความแจ้งเตือนในรูปแบบที่เป็นมิตรและเข้าใจง่าย
    st.info("กรุณาอัปโหลดไฟล์ก่อน")           #แสดงข้อความแจ้งเตือนให้ผู้ใช้ทราบว่าต้องอัปโหลดไฟล์ก่อนที่จะสามารถดูผลการพยากรณ์ได้ โดยใช้ st.info เพื่อแสดงข้อความแจ้งเตือนในรูปแบบที่เป็นมิตรและเข้าใจง่าย
