import os  # os คือ ใช้จัดการเกี่ยวกับระบบไฟล์ แบบ path โฟลเดอร์ได้ ติดตั้งไว้เผื่อใช้งาน 
from io import BytesIO # ใช้สร้างไฟล์ในหน่วยความจำแบบว่าจำลองไว้ในเว็บ เอาไว้ทำไฟล์ Excel เพื่อคนจะได้ ดาวน์โหลด โดยไม่ต้องสร้างไฟล์จริงในเครื่องเซิร์ฟเวอร์ ออกไปได้ 
import numpy as np # เกี่ยวกับตัวเลข
import pandas as pd #ไลบรารี่ Pandas มาใช้งานเกี่ยวกับด้าน Data 
import streamlit as st #ทำเว็บบน Streamlit 
import plotly.graph_objects as go  #เพื่อเรียกคำสั่งวาดกราฟได้ง่าย
from statsmodels.tsa.statespace.sarimax import SARIMAX #เพื่อเรียกใช้ โมเดลพยากรณ์อนุกรมเวลา SARIMAX ใช้เฉพาะข้อมูลที่เป็น ฤดูกาลเท่านั้นสำหรับโมเดลนี้
from sklearn.metrics import mean_squared_error  #sklearn คือ ใช้วัดความผิดพลาดของโมเดลพยากรณ์



##################################### Step 1 ทำเดือนให้เป็นภาษาไทย ###############################################
THAI_MONTH = [
    "มกราคม","กุมภาพันธ์","มีนาคม","เมษายน",
    "พฤษภาคม","มิถุนายน","กรกฎาคม","สิงหาคม",
    "กันยายน","ตุลาคม","พฤศจิกายน","ธันวาคม"
]


#ใช้ def เพราะจะได้เรียกใช้ในการเขียนเงื่อนไขหลายรอบ โครสร้าง
   # defฟังก์ชัน(ค่าที่รับมา):
   # คำสั่งทำงาน
   # return ผลลัพธ์


def thai_month(m):          #สร้างฟังก์ชันชื่อ thai_month ที่รับเลขเดือน m 
    return THAI_MONTH[m-1] #ดึงชื่อเดือนจาก List แล้วส่งกลับไป ที่-1 เพราะ เรียงเดือนใน List คือ  0-12 จึงใช้ -1  แบบว่า  12-1 = 11 คือตำแหน่งธันวาคม

def season_name(m): # สร้างฟังก์ชันชื่อ season_name เผื่อรับค่า m เพื่อเขียนฤดูกาล และ การกำหนดเกณฑ์การทำนายฝน
    if m in [5,6,7,8,9,10]:  #ดูว่าใน พฤษภาคม-ตุลาคม ถ้าใช่ ก็เป็น ฤดูฝน
        return "ฤดูฝน"
    if m in [11,12,1,2]:    #พย-กพ ถ้าใช่ ให้เป็นหนาว
        return "ฤดูหนาว"
    return "ฤดูร้อน"   #ถ้าไม่อยู่ในเงื่อนไข ฝน กับ หนาว ให้เป็น ร้อน

def interpret_rain(mm):    #ใช้ def สร้าง interpret_rain ในการตีความแปลผลการ ทำนาย ปริมาณนํ้าฝน ตามเดือน
    if mm >= 150:
        return "ตกมาก"
    if mm >= 60:
        return "ตกปานกลาง"
    if mm > 0:
        return "ตกน้อย"
    return "ไม่ตก"



############################################# Step 2 เตรียมข้อมูล ##############################################

def prepare_data(file):  #การสร้างฟังก์ชันสำหรับ เตรียมข้อมูล Excel ให้พร้อมใช้พยากรณ์ หรือ รับค่าExcel ที่ผู้ใช้งานใส่มาเผื่อวิเคราะห์

    df = pd.read_excel(file) #อ่านไฟล์ ที่ได้มา
    df.columns = [c.strip() for c in df.columns] #.strip() ใช้ลบช่องว่าง หน้า-หลัง ข้อความ ใน C= Columns 

    need = {"วันที่","โรงงาน","หมายเขตเขต","ชื่อเขต","ปริมาณฝนรายวัน"} #สร้างตัวแปร need เผื่อเก็บค่าข้อมูลคอลัมน์ วันที่,โรงงาน,หมายเขตเขต,ชื่อเขต,ปริมาณฝนรายวัน ที่มาจากไฟล์ข้อมูล Excel 
    if not need.issubset(df.columns): # สร้างเงื่อนไขตรวจสอบ คอลัมน์ จากไฟล์ ที่ได้มา 
        st.error("❌ คอลัมน์ในไฟล์ Excel ไม่ครบ")  # .error คือ คอลัมข้อมูลไม่ครบ ตามกำหนด
        st.stop() #stop คือ หยุดทำงาน

    df["วันที่"] = pd.to_datetime(df["วันที่"])   #.to_datetime ในpandas คือการแปลงข้อมูลให้เป็นวันที่ 
    df["ปริมาณฝนรายวัน"] = pd.to_numeric(      #แปลงค่าให้เป็นตัวเลข ส่วนที่ไม่มีค่าก็เป็นค่า NaN
        df["ปริมาณฝนรายวัน"], errors="coerce"   #coerce คือ ไม่มีตัวเลข ก็เป็นค่า NaN
    ).fillna(0) #ให้แทนค่า NaN เป็น 0

    df["เขต"] = (
        df["หมายเขตเขต"].astype(str).str.strip()   #แปลงข้อมูลให้เป็นข้อความก่อน แล้วค่อยตัดช่องว่างออก .astype() คือ เปลี่ยนชนิดข้อมูลของคอลัมน์//.strip คือ ลบช่องว่าง
        + " - " #ต่อข้อความ
        + df["ชื่อเขต"].astype(str).str.strip()
    )

    df["เดือน"] = df["วันที่"].dt.to_period("M").dt.to_timestamp()   #แปลงวันที่ → เป็นข้อมูลระดับเดือน เพื่อรวมฝนรายเดือนได้ /// .to_period python แปลงข้อมูลวันที่และเวลา
    return df


def monthly_by_district(df):  #เขียนลูปคือนำข้อมูลรายวันมาต่อกันเป็นรายเดือน และแยกตามโรง ตามเขต 
    return (
        df.groupby(["โรงงาน","เขต","เดือน"], as_index=False)
          .agg(ฝนรวม=("ปริมาณฝนรายวัน","sum"))
    )

#################################################### Step 3 การทำโมเดล train และ test ###############################################################################################

#----------------------------ส่วนที่ 1 ใช้โมเดล SARIMAX ในการพยากรณ์

def forecast_with_confidence(y, steps): #ฟังก์ชันสำหรับพยากรณ์ฝนพร้อมคำนวณความเชื่อมั่น /// def = การสร้างฟังก์ชัน แล้วตั้งชื่อ แล้ว รับค่ามา 2 ค่า คือ ตัวแปร y=ข้อมูลฝนรายเดือนย้อนหลัง , steps=จำนวนเดือนที่จะทำนายล่วงหน้า

    model = SARIMAX(  #ใช้โมเดล SARIMAX 
        y,
        order=(1,1,1), #กำหนดค่าพารามิเตอร์โมเดล รูปแบบมาจาก order = (p=ค่าฝนเดือนก่อนหน้า 1 เดือน, d=ลบแนวโน้มออก 1 ครั้ง , q=ความคลาดเคลื่อนในอดีต 1 ครั้ง )//ทำไมต้อง 1 เป็นค่ามาตรฐานที่: ไม่ซับซ้อนเกิน,เหมาะกับข้อมูลฝน,ทำงานเสถียร มีเพื่อให้มันเรียนรู้เอง
        seasonal_order=(1,1,1,12),  # seasonal_order = (P=ฤดูกาล 1 ปีก่อนหน้านี้ , D=ลบความต่างระหว่างปี/ลดผลกระทบปีที่ฝนมากผิดปกติ , Q=เรียนรู้จาก error แบบฤดูกาล , S=ความยาวของฤดูกาลความยาวของฤดูกาล )
        enforce_stationarity=False, #ไม่บังคับให้ข้อมูลต้องนิ่งก่อน โมเดลก็ยังทำงานได้ False=ทำงานได้  ////// #ข้อมูลนิ่ง = พฤติกรรมไม่เปลี่ยนตามเวลา,ข้อมูลไม่นิ่ง = พฤติกรรมเปลี่ยนไปเรื่อย ๆ
        enforce_invertibility=False  #ไม่ต้องตามเงื่อนไขก็คำนวณได้ 
    )
    res = model.fit(disp=False)           #.fit ใช้ใน Scikit-learn เพื่อ train ML โดยการป้อนข้อมูล (X, y)                    
                                         # disp จะให้แสดงข้อความขั้นตอนการคำนวณของโมเดลหรือไม่ โดย  True แสดงการคำนวณยาว ๆ , False ไม่แสดงอะไร

    fc = res.get_forecast(steps)  #ใช้สั่งให้โมเดลที่ผ่านการเทรน แล้วทำการพยากรณ์ค่าฝนล่วงหน้าตามจำนวนเดือนที่กำหนดในตัวแปร steps
    mean = fc.predicted_mean.clip(lower=0)  #เอาผลทำนายฝนมาใช้ พร้อมแก้ค่าที่เป็นลบให้เป็นศูนย์

    # ----------ส่วนที่ 2 คำนวณ Confidence ความเชื่อมั่น----------
    
    if len(y) >= 36:   #ถ้ามีข้อมูลอย่างน้อย 36 เดือน หรือ 3 ปี ขึ้นไป ถึงจะเริ่มวัดความแม่นได้

        train = y[:-12]  #เอาข้อมูล ช่วงแรกทั้งหมด ยกเว้น 12 เดือนสุดท้าย ใช้ Train โมเดล
        test = y[-12:]   #เอาข้อมูล 12 เดือนสุดท้าย มา Test 

        pred = res.predict(   #res.predict() คือการให้โมเดลที่เรียนรู้แล้วลองทำนายช่วงเวลาที่เรากำหนด เพื่อเอาไปวัดความแม่น
            start=test.index[0],   #จุดเริ่มต้นของการพยากรณ์ให้ตรงกับเดือนแรกของชุดข้อมูลทดสอบ เพื่อให้สามารถเปรียบเทียบค่าจริงและค่าพยากรณ์ในช่วงเวลาเดียวกันได้
            end=test.index[-1]     #-1 เพื่อหยุดการ test ให้ตรงกับเดือนสุดท้าย
        ).clip(lower=0) #.clip เพื่อปรับค่าไม่ให้ฝนติดลบ ให้เป็น 0 แทน เพราะความเป็นจริง ฝนติดลบบ่ได้จ้า

        rmse = np.sqrt(mean_squared_error(test, pred)) #การคำนวณความแม่นของโมเดลพยากรณ์ Test ค่าฝนจริง 12 เดือนสุดท้าย,pred ค่าฝนที่โมเดลทำนายช่วงเดียวกัน เพื่อ ค่าจริงกับค่าทำนาย ต่างกันมากแค่ไหน

        #---------------ส่วนที่ 3 สูตรคำนวณค่า RMSE ย่อจาก Root Mean Squared Error
        nrmse = rmse / (y.max() - y.min() + 1e-6) #การแปลงค่า RMSE ค่าเฉลี่ยความคาดเคลื่อน ยิ่งตํ่ายิ่งดี 

        #---------------ส่วนที่ 4 ค่า nrmse (Normalized Root Mean Squared Error) 
        base_conf = 100 * np.exp(-nrmse * 1.5) #NRMSE คือการเอาค่าพลาดของโมเดล มาเทียบกับช่วงข้อมูลจริง เพื่อดูว่า “พลาดกี่เปอร์เซ็นต์ของข้อมูล”

        #---------------ส่วนที่ 5 data_bonus เป็นการเพิ่มคะแนนความเชื่อมั่นตามปริมาณข้อมูลย้อนหลัง โดยหากมีข้อมูลตั้งแต่ 60 เดือนขึ้นไปจะได้โบนัสเต็ม 10 คะแนน และหากน้อยกว่าจะให้ตามสัดส่วน
        data_bonus = 10 if len(y) >= 60 else (len(y) / 60 * 10) #ปรับค่าความเชื่อมั่นโมเดลให้สูงขึ้น แต่ก่อนใช้ MAE (Mean Absolute Error) ซึ่งค่าความเชื่อมั่นมันตํ่า 
                                                                #ใช้ตัวนี้ปรับเพราะทำแบบนี้เพื่อให้คะแนนความเชื่อมั่นสะท้อนความจริงว่าโมเดลที่มีข้อมูลเยอะย่อมน่าเชื่อถือกว่าโมเดลที่มีข้อมูลน้อย
                                                                #และไม่ได้ทำให้ค่าความเชื่อมั่นเพี้ยน เพราะยังอิงความแม่นเป็นหลัก นอกจากนี้ยังมีการถ่วงไม่ให้ค่าพุ่งเกินไป 
                                                                
                                                                
        #---------------ส่วนที่ 6 หักความผันผวน เพราะ ฝนขึ้น ๆ ลง ๆ แรง โมเดลทำนายยาก ความเสี่ยงสูง ยิ่งข้อมูลผันผวน → ยิ่งโดนหักคะแนน
        volatility_penalty = min(
            y.std() / (y.mean() + 1e-6) * 6, 6 #mean = 0 จะไม่ error,หักได้สูงสุดไม่เกิน 6 คะแนน
        )

        conf = base_conf + data_bonus - volatility_penalty #คชม = โบนัส-ความผันผวน

        #-------------ส่วนที่ 7 #cap 75–95% คือ การกำหนดกรอบบน–ล่างของคะแนน เพราะไม่ใช้โมเดลได้ 100 และจะได้ไม่ตํ่าเกินไปจนไม่หน้าใช้ ้#confidence = ค่าความเชื่อมั่นของผลพยากรณ์
        if len(y) >= 60:
            conf = np.clip(conf, 75, 95)  #มีข้อมูล ≥ 5 ปี	75–95%
        else:
            conf = np.clip(conf, 60, 90) #ข้อมูลน้อยกว่า 60–90%
        #if len(y) >= 60:

    else:   
                      
       conf = 75 
    return mean, round(conf, 1) #ถ้า Data น้อยกว่า 36 กำหนดค่าความเชื่อมั่นเริ่มต้นที่ 75% และส่งผลลัพธ์ออกจากฟังก์ชันในรูปแบบ ค่าพยากรณ์, ความเชื่อมั่น โดยปัดทศนิยมของความเชื่อมั่นเป็น 1 ตำแหน่ง ปล.ปัดขึ้นหรือลงตามหลักคณิตเลย
         



########################################## Step 4 Export Excel ########################################################

def export_excel(df):
    bio = BytesIO()
    with pd.ExcelWriter(bio, engine="openpyxl") as w:
        df.to_excel(w, index=False, sheet_name="Forecast")
    bio.seek(0)
    return bio


######################################## Step 5 ออกแบบหน้าเว็บ ###############################################################

#-----------------ส่วนที่ 1 ส่วนหัว 
st.set_page_config(page_title="พยากรณ์น้ำฝน", layout="wide")

logo_url = "https://raw.githubusercontent.com/Kanchanasuda-hub/Data-Rainfall/7ed2cf8806a54c62c7cbbbd802077b68ae125f64/logo.png.jpg"

c1, c2 = st.columns([1, 6])

with c1:
    st.image(logo_url, width=120)

with c2:
    st.markdown(
        """
        <div style='display:flex; flex-direction:column; justify-content:center; height:120px;'>
            <h2 style='margin:0;'> พยากรณ์น้ำฝนรายโรงงานและเขตส่งเสริม</h2>
        </div>
        """,
        unsafe_allow_html=True
    )

st.divider()

# --------------------ส่วนที่ 2  Sidebar ด้านข้าง
with st.sidebar:
    file = st.file_uploader("📂 อัปโหลดไฟล์ Excel", type=["xlsx"])
    steps = st.slider("พยากรณ์ล่วงหน้า (เดือน)", 3, 24, 12)
    view = st.radio("มุมมอง", ["ภาพรวมโรงงาน","รายเขต"])

if not file:
    st.info("⬅️ กรุณาอัปโหลดไฟล์ Excel")
    st.stop()

# --------------------ส่วนที่ 3 Process การทำงาน ของเว็บ

df = prepare_data(file)
md = monthly_by_district(df)

factory = st.selectbox("เลือกโรงงาน", sorted(md["โรงงาน"].unique()))

if view == "รายเขต":
    district = st.selectbox(
        "เลือกเขต",
        sorted(md[md["โรงงาน"]==factory]["เขต"].unique())
    )
    data = md[(md["โรงงาน"]==factory) & (md["เขต"]==district)]
else:
    data = (
        md[md["โรงงาน"]==factory]
        .groupby("เดือน", as_index=False)
        .agg(ฝนรวม=("ฝนรวม","mean"))
    )

y = data.sort_values("เดือน").set_index("เดือน")["ฝนรวม"].asfreq("MS").fillna(0)

forecast_mean, confidence = forecast_with_confidence(y, steps)

# -------------------ส่วนที่ 4 เฉพาะปีที่พยากรณ์ 
year = forecast_mean.index[0].year
plot_df = forecast_mean[forecast_mean.index.year == year]

# -------------------ส่วนที่ 5 กราฟ ที่ได้จากการพยากรณ์
fig = go.Figure()
fig.add_trace(go.Scatter(
    x=[thai_month(d.month) for d in plot_df.index],
    y=plot_df.values,
    mode="lines+markers",
    name="Forecast"
))

fig.update_layout(
    title=f"พยากรณ์น้ำฝน ปี {year+543}",
    xaxis_title="เดือน",
    yaxis_title="ปริมาณฝน (มม.)"
)

st.plotly_chart(fig, width="stretch")

# -------------------------ส่วนที่ 6 ตาราง แสดงผลข้อมูลที่วิเคราะห์
table = pd.DataFrame({
    "เดือน": [thai_month(d.month) for d in plot_df.index],
    "ฤดู": [season_name(d.month) for d in plot_df.index],
    "พยากรณ์ฝน (มม.)": plot_df.values.round(2),
    "แปลผล": [interpret_rain(v) for v in plot_df.values],
    "ความเชื่อมั่น (%)": confidence
})

st.dataframe(table, width="stretch")

# ---------------------------ส่วนที่ 7 การนำไฟล์ Excel ของผลวิเคราะห์ออก
st.download_button(
    "📥 ดาวน์โหลดผลพยากรณ์ (Excel)",
    export_excel(table),
    file_name=f"Rainfall_Forecast_{factory}_{year+543}.xlsx"
)








